################ 1번
func=function(x,y){
x^2+exp(-y^2/2)
}
func(5,2)

################ 2번
func2=function(x,y,z){
1/sqrt(2*pi*z^2)*exp(-(x-y)^2/(2*z^2)) # 여기서 (2*z^2)를 꼭 괄호로 묶어줘야함. 파이썬도 그렇고 R도 그렇고 *와/가 우선순위가 같아서 그럼. 그리고 2z^2 이렇게 하는거 조심 오류남.
}
func2(2,3,4)

################ 2번 모범 답안. 문제에 나오는 수학적 의미를 제대로 표현
func2 <- function(x, mu, sigma){
  1/sqrt(2*pi*sigma^2)*exp(-(x-mu)^2/(2*sigma^2))
}

################ 3번
D=function(p){
x=1:5
y=c(2,4,7,9,10)
(sum(abs(x-y)^p))^(1/p)
}
D(3)
################ 3번 모범 답안. 
D <- function(x, y, p){
  (sum(abs(x-y)^p))^(1/p)   # abs()는 절댓값


x <- c(1,2,3,4,5)
y <- c(2,4,7,9,10)

D(x,y,3)


# result()를 쓰면 즉시 함수식이 종료가 됨. 
일반적으로 R은 자동으로 결과가 반환되기 때문에 result()를 생략할 수 있음. 하지만, 식이 복잡해지거나 조건이 붙는 경우 result()를 활용가능함.